In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

import os

data=pd.read_csv("C:/PyProj/terror.csv",header=0,sep=',',na_values=[''],encoding="latin")
data.head()

C:\Users\Madhu-PC\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3057: DtypeWarning: Columns (4,61,62,66,116,117,123) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   suicide  success
0        0        1
1        0        1
2        0        1
3        0        1
4        0        1

In [3]:
data.query("country_txt=='India'").shape[0]

9940

In [4]:
data.query("country_txt=='India' and nkill<=3").shape[0]

8362

In [10]:
data.query("country_txt=='India' and nkill<=3")[['city','summary']]

                     city                                            summary
1185            New Delhi                                                NaN
3780            New Delhi                                                NaN
5251               Bombay                                                NaN
7266               Imphal                                                NaN
8609              Unknown                                                NaN
8755              Unknown                                                NaN
8977               Amapur                                                NaN
9037             Raisikah                                                NaN
9040             Champhai                                                NaN
9070               Aizawl                                                NaN
9072           Jamshedpur                                                NaN
9081            New Delhi                                                NaN
9082            New Delhi                                                NaN
9090           Jamshedpur                                                NaN
9137              Chennai                                                NaN
9691              Unknown                                                NaN
9732              Unknown                                                NaN
9801              Unknown                                                NaN
9841               Imphal                                                NaN
9887              Unknown                                                NaN
10407           Chiaplant                                                NaN
10522            Calcutta                                                NaN
10744           New Delhi                                                NaN
12187             Unknown                                                NaN
12391             Unknown                                                NaN
12439             Unknown                                                NaN
13049             Gauhati                                                NaN
13177              Jorhat                                                NaN
13300             Unknown                                                NaN
13875             Unknown                                                NaN
...                   ...                                                ...
156156         Dariyakona  12/15/2015: Assailants abducted Baghel Gond fr...
156176           Awapalli  12/15/2015: An explosive device detonated in A...
156243           Srinagar  12/17/2015: Assailants fired a rifle grenade a...
156248             Imphal  12/17/2015: An explosive device detonated in D...
156249       Williamnagar  12/17/2015: Assailants threw a grenade at a st...
156292     Pookottumpadam  12/18/2015: Assailants attacked an Indian Fore...
156314        Kalia Atala  12/19/2015: Assailants torched an Airtel cell ...
156339           Chipakur  12/20/2015: Assailants torched an under-constr...
156340            Kakpora  12/20/2015: Assailants threw a grenade at the ...
156383    Bastar district  12/21/2015: Security forces arrested three ass...
156384       Madathakonda  12/21/2015: Assailants abducted and killed Van...
156385       Madathakonda  12/21/2015: Assailants beat a civilian in Mada...
156388       Badapokharia  12/21/2015: Assailants threw at least nine cru...
156389      Simra Nizamat  12/21/2015: Police discovered and defused two ...
156433             Imphal  12/22/2015: Assailants shot and killed a baker...
156458           Nilawaya  12/23/2015: Assailants abducted Hadma Ram, a f...
156459             Imphal  12/23/2015: An explosive device planted under ...
156483          Bijbehara  12/24/2015: Assailants opened fire on police p...
156499            Ramgarh  12/24/2015: Assailants detonated explosive dev...
156529          Badapadar  12/25/2015: Assailants attacked Jayaram Khara ...
156530  Kudumulgumma Raba  12/25/2015: Assailants attacked Sahdev Badanay...
156533          Sivasagar  12/25/2015: Security forces discovered and def...
156569             Pariya  12/26/2015: Assailants abducted Sujit Modiyami...
156612           Tillayya  12/26/2015: An assailant attempted to plant an...
156658            Mendhar  12/27/2015: An explosive device planted under ...
156695              Terem  12/29/2015: Assailants abducted three students...
156698         Peravurani  12/29/2015: An explosive device was discovered...
156713          Tulsibari  12/29/2015: Assailants abducted Hazrat Ali in ...
156725            Zhutovi  12/30/2015: Assailants attempted to extort mon...
156756           Srinagar  12/31/2015: Assailants threw a grenade at an I...

[8362 rows x 2 columns]

In [20]:
data.query("country_txt=='India'")[["city","nkill"]].sort_values("nkill",ascending=False).head()

                     city  nkill
81000              Mumbai  188.0
96598             Jhargam  115.0
54339              Bombay  115.0
95860  Dantewada district   82.0
56837            Banabari   70.0

In [18]:
data.query("country_txt=='India'")[['city','nkill','nwound']].sort_values(['nkill','nwound'],ascending=False).head()

                     city  nkill  nwound
81000              Mumbai  188.0   817.0
96598             Jhargam  115.0   140.0
54339              Bombay  115.0     0.0
95860  Dantewada district   82.0     0.0
56837            Banabari   70.0   100.0

In [15]:
data.query("suicide==1 & success==1").shape[0]

4260

In [24]:
label=(data["nkill"]>5).map({True:"Severe",False:"Not Severe"})

In [26]:
label.head()

0    Not Severe
1    Not Severe
2    Not Severe
3    Not Severe
4    Not Severe
Name: nkill, dtype: object

In [30]:
def fun_label(x):
    if (x[0]==1 & x[1]==1):
        return True
    else :
        return False
    
label = data[["suicide","success"]].apply(fun_label,axis=1)

In [31]:
label.head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [5]:
def fun_label(x):
    if (x[0]=="Afghanistan" or  x[0]=="Pakistan" or x[0]=="India"):
        return "Asia"
    else :
        return "ROW"
    
data['Local'] = data[["country_txt"]].apply(fun_label,axis=1)
data['Local'].head()

0    ROW
1    ROW
2    ROW
3    ROW
4    ROW
Name: Local, dtype: object

In [42]:
data.groupby("Local").agg({"Local":np.size})

        Local
Local
Asia    32398
ROW    124374

In [41]:
data.query("suicide==1").groupby('Local')[['Local','nkill']].agg({"Local":np.size,"nkill":np.mean}).rename(columns={"Local":'Number_Incidents',"nkill":'Average_kills'})

       Number_Incidents  Average_kills
Local
Asia               1462       8.127404
ROW                3309      11.511403

In [43]:
data["Local"].value_counts()

ROW     124374
Asia     32398
Name: Local, dtype: int64

In [44]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

stack=pd.read_csv("C:/PyProj/stackoverflow.csv",header=0,sep=',',na_values=[''],encoding="latin")
stack.head()

,RespondentID,Country,Salary,YearsCodedJob,OpenSource,Hobby,CompanySizeNumber,Remote,CareerSatisfaction,Datascientist,...,DevOps,Embedded developer,Graphic designer,Graphics programming,Machine learning specialist,Mobile developer,Quality assurance engineer,Systems administrator,Web developer,
0,3,United Kingdom,113750.0,20,1,1,10000.0,Not remote,8,0,...,0,0,0,0,0,0,0,0,0,NaN
1,15,United Kingdom,100000.0,20,0,1,5000.0,Remote,8,0,...,0,1,0,0,0,0,0,0,0,NaN
2,18,United States,130000.0,20,1,1,1000.0,Remote,9,0,...,1,1,0,0,0,0,1,0,1,NaN
3,19,United States,82500.0,3,0,1,10000.0,Not remote,5,0,...,0,0,0,0,0,0,0,0,1,NaN
4,26,United States,175000.0,16,0,1,10000.0,Not remote,7,0,...,0,0,0,0,0,0,0,0,1,NaN

In [45]:
stack.shape

(6991, 23)

In [46]:
stack.isnull().sum()

RespondentID                               0
Country                                    0
Salary                                     0
YearsCodedJob                              0
OpenSource                                 0
Hobby                                      0
CompanySizeNumber                         31
Remote                                     0
CareerSatisfaction                         0
Datascientist                              0
Database administrator                     0
Desktop applications developer             0
Developer with stats/math background       0
DevOps                                     0
Embedded developer                         0
Graphic designer                           0
Graphics programming                       0
Machine learning specialist                0
Mobile developer                           0
Quality assurance engineer                 0
Systems administrator                      0
Web developer                              0
                                        6991
dtype: int64

In [49]:
len(stack.Country.unique())

5

In [50]:
stack.query("Country=='India' and Datascientist==1").shape[0]

43

In [52]:
stack.query("Remote=='Remote'").shape[0]

718

In [53]:
stack.query("Country=='Germany' and YearsCodedJob >10").shape[0]

181

In [57]:
stack.groupby("Country", as_index=False).agg({"Salary":np.mean}).sort_values("Salary", ascending=False)

          Country        Salary
4   United States  98313.127654
0          Canada  58226.407451
3  United Kingdom  53962.871808
1         Germany  52405.823429
2           India  11557.674529

In [59]:
stack.query("Remote=='Remote'").groupby("Country").agg({"Country":np.size})

                Country
Country
Canada               43
Germany              49
India                66
United Kingdom       85
United States       475

In [64]:
stack[stack["Mobile developer"] == 1].shape[0]/stack.shape[0]

0.19396366757259334

In [65]:
stack[stack["Web developer"] == 1].shape[0]/stack.shape[0]

0.7240738091832356

In [69]:
stack[(stack["Web developer"] == 1) & (stack["Mobile developer"] == 1) & (stack["Remote"]=="Remote") ].shape[0]

115

In [73]:
stack.groupby("Country", as_index=False).agg({"Salary":np.max, "YearsCodedJob":np.mean}).sort_values("Salary", ascending=False)

          Country       Salary  YearsCodedJob
4   United States  197000.0000       8.397877
3  United Kingdom  193750.0000       7.315748
2           India  163134.7967       3.696697
0          Canada  151515.1515       7.523425
1         Germany  140000.0000       7.058947

In [74]:
def func(x):
    if x<20:
        return "Low"
    elif x>=20 and x<=1000:
        return "Medium"
    else:
        return "High"

stack["Company_label"]=stack["CompanySizeNumber"].map(func)
stack["Company_label"].value_counts()

Medium    4305
High      1530
Low       1156
Name: Company_label, dtype: int64

In [75]:
def get_label(x):
    if x["Datascientist"]==1 or x["Machine learning specialist"]==1 or x["Developer with stats/math background"]==1:
        return 1
    else:
        return 0
    
stack["label"]=stack.apply(get_label,axis=1)
stack["label"].value_counts()

0    5862
1    1129
Name: label, dtype: int64